import CryptoJS from 'crypto-js'

const key = CryptoJS.enc.Utf8.parse('fgfdjgkj3455')

export const cryptoEncode = data => {
  const encryptedData = CryptoJS.AES.encrypt(data, key, {
    mode: CryptoJS.mode.ECB,
    padding: CryptoJS.pad.Pkcs7
  }).toString()
  return encryptedData
}

export const data = [
  { code: 'G-A000010', name: '河南正舟信息技术有限公司', time: '2022-9-30' },
  {
    code: 'G-A000011',
    name: '青岛易软天创网络科技有限公司',
    time: '2022-10-09'
  },
  { code: 'G-A000012', name: '王伦海', time: '2022-10-11' },
  { code: 'G-A000013', name: '辽宁沙果云科技有限公司', time: '2022-10-16' },
  { code: 'G-A000014', name: '梅州正方网络有限公司', time: '2022-10-21' },
  { code: 'G-A000015', name: '深圳简道智能有限公司', time: '2022-10-27' },
  { code: 'G-A000016', name: '崔学文', time: '2022-11-07' },
  { code: 'G-A000017', name: '菲玛斯(上海)科技有限公司', time: '2022-11-07' },
  { code: 'G-A000018', name: '温州众铱软件技术有限公司', time: '2022-11-07' },
  { code: 'G-A000019', name: '沈阳万象云鼎科技有限公司', time: '2022-11-09' },
  { code: 'G-A000020', name: '温州三缔科技有限公司', time: '2022-11-11' },
  { code: 'G-A000021', name: '慧购智能科技(江苏)有限公司', time: '2022-11-12' },
  { code: 'G-A000022', name: '北京水木宏创科技有限公司', time: '2022-11-15' },
  { code: 'G-A000023', name: '梁福来', time: '2022-11-25' },
  { code: 'G-A000024', name: '西安祥和智能科技有限公', time: '2022-12-01' },
  { code: 'G-A000025', name: '广州明动软件股份有限公司', time: '2022-12-02' },
  { code: 'G-A000026', name: '深圳市前海金顺科技有限公司', time: '2022-12-03' },
  {
    code: 'G-A000027',
    name: '中国能源建设集团天津电力建设有限公司',
    time: '2022-12-05'
  },
  { code: 'G-A000028', name: '武汉啸锋科技有限公司', time: '2022-12-07' },
  { code: 'G-A000029', name: '四川省万道通科技有限公司.', time: '2022-12-22' },
  { code: 'G-A000030', name: '成都云腾五洲科技有限公司', time: '2023-01-08' },
  { code: 'G-A000031', name: '苏州真容软件有限公', time: '2023-01-17' },
  { code: 'G-A000032', name: '泉州市时信软件开发有限公司', time: '2023-01-17' },
  { code: 'G-A000033', name: '南通汉联自动化科技有限公司', time: '2023-02-01' },
  {
    code: 'G-A000034',
    name: '绿住云（杭州）信息技术有限公司',
    time: '2023-02-02'
  },
  { code: 'G-A000035', name: '北京星河千帆科技有限公司', time: '2023-02-15' },
  { code: 'G-A000036', name: '广东轻亿云软件科技有限公司', time: '2023-02-17' },
  {
    code: 'G-A000037',
    name: '陕西艾倍特斯信息技术有限公司',
    time: '2023-02-20'
  },
  {
    code: 'G-A000038',
    name: '依柯力信息科技(上海)股份有限公司',
    time: '2023-02-20'
  },
  { code: 'G-A000039', name: '南京鑫和网络有限公司', time: '2023-02-22' },
  { code: 'G-A000040', name: '北京万旺科技有限公司', time: '2023-02-24' },
  {
    code: 'G-A000041',
    name: '福建纵横云创信息科技有限公司',
    time: '2023-02-27'
  },
  {
    code: 'G-A000042',
    name: '深圳迅维数字孪生技术有限公司',
    time: '2023-03-01'
  },
  {
    code: 'G-A000043',
    name: '珠海优特电力科技股份有限公司',
    time: '2023-03-02'
  },
  { code: 'G-A000044', name: '武汉禾店科技有限公司', time: '2023-03-02' },
  { code: 'G-A000045', name: '北京中航路通科技有限公司', time: '2023-03-02' },
  { code: 'G-A000046', name: '湖南小游信息技术有限公司', time: '2023-03-03' },
  { code: 'G-A000047', name: '深圳市从晶科技有限公司', time: '2023-03-08' },
  {
    code: 'G-A000048',
    name: '星河激荡（南京）数字科技有限公司',
    time: '2023-03-08'
  },
  { code: 'G-A000049', name: '无锡石炭纪科技有限公司', time: '2023-03-13' },
  { code: 'G-A000050', name: '北京中奇朗克科技有限公司', time: '2023-03-29' },
  { code: 'G-A000051', name: '杭州乐芯科技有限公司', time: '2023-04-03' },
  {
    code: 'G-A000052',
    name: '优势无限（海南）科技有限公司',
    time: '2023-04-03'
  },
  { code: 'G-A000053', name: '惟快云科技（广州）有限公司', time: '2023-04-03' },
  { code: 'G-A000054', name: '深圳融安网络科技有限公司', time: '2023-04-04' },
  {
    code: 'G-A000055',
    name: '山东金实创展信息科技有限公司',
    time: '2023-04-05'
  },
  { code: 'G-A000056', name: '攀枝花市顺扬科技有限公司', time: '2023-04-07' },
  { code: 'G-A000057', name: '青岛达译智能科技有限公司', time: '2023-04-11' },
  { code: 'G-A000058', name: '浙江众乐信息技术有限公司', time: '2023-04-11' },
  { code: 'G-A000059', name: '中山市前卫软件科技有限公司', time: '2023-04-17' },
  { code: 'G-A000060', name: '北京兰诚科技有限公司', time: '2023-04-17' },
  {
    code: 'G-A000061',
    name: '济南兰禾工业技术服务有限公司',
    time: '2023-04-19'
  },
  { code: 'G-A000062', name: '青岛皓润数字技术有限公司', time: '2023-04-19' },
  { code: 'G-A000063', name: '付佳伟', time: '2023-04-19' },
  { code: 'G-A000064', name: '深圳市博普啦科技有限公司', time: '2023-04-23' },
  { code: 'G-A000065', name: '山东浪潮数字服务有限公司', time: '2023-05-05' },
  { code: 'G-A000066', name: '四川乐政科技有限公司', time: '2023-05-08' },
  {
    code: 'G-A000067',
    name: '北京百分点科技集团股份有限公司',
    time: '2023-05-08'
  },
  { code: 'G-A000068', name: '北京腾文科技有限公司', time: '2023-05-08' },
  {
    code: 'G-A000069',
    name: '北京中水科水电科技开发有限公司',
    time: '2023-05-10'
  },
  { code: 'G-A000070', name: '河南小南网络科技有限公司', time: '2023-05-11' },
  { code: 'G-A000071', name: '吴雨鑫', time: '2023-05-12' },
  { code: 'G-A000072', name: '江苏芮捷智能科技有限公司', time: '2023-05-15' },
  { code: 'G-A000073', name: '邱元忠', time: '2023-05-15-' },
  { code: 'G-A000074', name: '山东环球软件股份有限公司', time: '2023-05-16' },
  { code: 'G-A000075', name: '上海天正信息科技有限公司', time: '2023-05-26' },
  { code: 'G-A000076', name: '天津洪荒科技有限公司', time: '2023-05-26' },
  { code: 'G-A000077', name: '广州铭匠信息技术有限公司', time: '2023-05-30' },
  {
    code: 'G-A000078',
    name: '浙江恩大施福软件科技有限公司',
    time: '2023-06-03'
  },
  { code: 'G-A000079', name: '北京熙诚紫光科技有限公司', time: '2023-06-03' },
  { code: 'G-A000080', name: '姜铁久', time: '2023-06-08' },
  { code: 'G-A000081', name: '杭州智德软件科技有限公司', time: '2023-06-09' },
  { code: 'G-A000082', name: '无锡艾欧物联网科技有限公司', time: '2023-06-09' },
  {
    code: 'G-A000083',
    name: '长沙组控信息技术有限责任公司',
    time: '2023-06-14'
  },
  { code: 'G-A000084', name: '北京睛像科技有限公司', time: '2023-06-25' },
  {
    code: 'G-A000085',
    name: '山东易构软件技术股份有限公司',
    time: '2023-06-25'
  },
  { code: 'G-A000086', name: '杭州数旷科技有限公司', time: '2023-06-26' },
  {
    code: 'G-A000087',
    name: '迅济智能科技（上海）有限公司',
    time: '2023-06-28'
  },
  {
    code: 'G-A000088',
    name: '正泰集团研发中心（上海）有限公司',
    time: '2023-07-03'
  },
  { code: 'G-A000089', name: '北京一采通信息科技有限公司', time: '2023-07-04' },
  {
    code: 'G-A000090',
    name: '深圳市新焦点自动化技术有限公司',
    time: '2023-07-07'
  },
  { code: 'G-A000091', name: '上海金榜智能科技有限公司', time: '2023-07-07' },
  {
    code: 'G-A000092',
    name: '深圳市智源光通讯技术有限公司',
    time: '2023-07-10'
  },
  { code: 'G-A000093', name: '眉山市良金网络科技有限公司', time: '2023-07-13' },
  { code: 'G-A000094', name: '四川樯晟网络科技有限公司', time: '2023-07-14' },
  { code: 'G-A000095', name: '上海新程医学科技有限公司', time: '2023-07-14' },
  { code: 'G-A000096', name: '杭州研一智控科技有限公司', time: '2023-07-17' },
  { code: 'G-A000097', name: '上海巨匠软件有限公司', time: '2023-07-19' },
  { code: 'G-A000098', name: '湖南新展信息技术有限公司', time: '2023-07-21' },
  { code: 'G-A000099', name: '南京阿贝斯信息科技有限公司', time: '2023-07-21' },
  { code: 'G-A0000100', name: '北京桔柚科技有限公司', time: '2023-07-25' },
  { code: 'G-A0000101', name: '白玉', time: '2023-07-25' },
  {
    code: 'G-A0000102',
    name: '江苏东印智慧工程技术研究院有限公司',
    time: '2023-07-27'
  },
  { code: 'G-A0000103', name: '熊永洪', time: '2023-08-01' },
  { code: 'G-A0000104', name: '许华群', time: '2023-08-01' },
  { code: 'G-A0000105', name: '邓猛', time: '2023-08-01' },
  {
    code: 'G-A0000106',
    name: '上海大唐移动通信设备有限公司',
    time: '2023-08-01'
  },
  { code: 'G-A0000107', name: '陈彦', time: '2023-08-01' },
  { code: 'G-A0000108', name: '张厚森', time: '2023-08-01' },
  { code: 'G-A0000109', name: '深圳凯德联众技术有限公司', time: '2023-08-01' },
  { code: 'G-A0000110', name: '李建林', time: '2023-08-01' },
  { code: 'G-A0000111', name: '刘春波', time: '2023-08-01' },
  { code: 'G-A0000112', name: '刘正安', time: '2023-08-01' },
  { code: 'G-A0000113', name: '张子轩', time: '2023-08-01' },
  { code: 'G-A0000114', name: '马熙雨', time: '2023-08-01' },
  { code: 'G-A0000115', name: '周连俊', time: '2023-08-01' },
  { code: 'G-A0000116', name: '陈鹏', time: '2023-08-01' },
  { code: 'G-A0000117', name: '钟煜', time: '2023-08-01' },
  { code: 'G-A0000118', name: '徐德平', time: '2023-08-01' },
  {
    code: 'G-A0000119',
    name: '武汉百景互动科技有限责任公司',
    time: '2023-08-01'
  },
  { code: 'G-A0000120', name: '智勇植', time: '2023-08-01' },
  { code: 'G-A0000121', name: '潘文', time: '2023-08-01' },
  { code: 'G-A0000122', name: '浙江浙能数字科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000123', name: '薛斐', time: '2023-08-01' },
  { code: 'G-A0000124', name: '敬宇', time: '2023-08-01' },
  { code: 'G-A0000125', name: '张宇', time: '2023-08-01' },
  { code: 'G-A0000126', name: '张强', time: '2023-08-01' },
  {
    code: 'G-A0000127',
    name: '江苏省测绘地理信息局信息中心',
    time: '2023-08-01'
  },
  { code: 'G-A0000128', name: '辽宁瑞内森科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000129', name: '郑兴苗', time: '2023-08-01' },
  { code: 'G-A0000130', name: '赵云波', time: '2023-08-01' },
  { code: 'G-A0000131', name: '方艺阳', time: '2023-08-01' },
  { code: 'G-A0000132', name: '云南数派数据科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000133', name: '厦门二叉树科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000134', name: '北京拓唯科技有限公司', time: '2023-08-01' },
  {
    code: 'G-A0000135',
    name: '盐城市至上网络科技有限公司',
    time: '2023-08-01'
  },
  {
    code: 'G-A0000136',
    name: '上海金不换实业集团有限公司',
    time: '2023-08-01'
  },
  { code: 'G-A0000137', name: '杭州星宸智联技术有限公司', time: '2023-08-01' },
  {
    code: 'G-A0000138',
    name: '上海英拓企业管理咨询有限公司',
    time: '2023-08-01'
  },
  { code: 'G-A0000139', name: '云南羽成科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000140', name: '武汉小猿科技有限公司', time: '2023-08-01' },
  { code: 'G-A0000141', name: '广东云助科技有限公司', time: '2023-08-04' },
  { code: 'G-A0000142', name: '郑州单点科技软件有限公司', time: '2023-08-17' },
  { code: 'G-A0000143', name: '长江龙新媒体有限公司', time: '2023-08-21' },
  { code: 'G-A0000144', name: '贵州戴玛科技有限公司', time: '2023-08-21' },
  {
    code: 'G-A0000145',
    name: '中科育软（苏州）智能科技有限公司',
    time: '2023-08-22'
  },
  { code: 'G-A0000146', name: '黄金', time: '2023-08-23' },
  { code: 'G-A0000147', name: '江西字节信息技术有限公司', time: '2023-08-25' },
  {
    code: 'G-A0000148',
    name: '中科科界（北京）科技有限公司',
    time: '2023-08-25'
  },
  { code: 'G-A0000149', name: '杨春凯', time: '2023-08-25' },
  { code: 'G-A0000150', name: '联通智网科技股份有限公司', time: '2023-08-25' },
  {
    code: 'G-A0000151',
    name: '友达数位科技服务（苏州）有限公司',
    time: '2023-08-25'
  },
  {
    code: 'G-A0000152',
    name: '内蒙古科技大学包头医学院第二附属医院',
    time: '2023-'
  },
  { code: 'G-A0000153', name: '张春涛', time: '2023-09-06' },
  {
    code: 'G-A0000154',
    name: '长沙市九源晟智能科技有限责任公司',
    time: '2023-09-06'
  },
  {
    code: 'G-A0000155',
    name: '南方之星（广东）科技有限公司',
    time: '2023-09-11'
  },
  { code: 'G-A0000156', name: '深圳市由你创科技有限公司', time: '2023-09-14' },
  {
    code: 'G-A0000157',
    name: '深圳市纵横云数信息科技有限公司',
    time: '2023-09-19'
  },
  { code: 'G-A0000158', name: '泰兴市智秋信息技术中心', time: '2023-09-20' },
  { code: 'G-A0000159', name: '成都陆拓信息技术有限公司', time: '2023-10-13' },
  { code: 'G-A0000160', name: '苏州鸣天科技有限公司', time: '2023-10-16' },
  { code: 'G-A0000161', name: '新华三技术有限公司', time: '2023-10-24' },
  { code: 'G-A0000162', name: '上海讯牛网络科技有限公司', time: '2023-10-27' },
  { code: 'G-A0000163', name: '苏州儒拉玛特智芸科技', time: '2023-10-29' },
  { code: 'G-A0000164', name: '曾超', time: '2023-10-31' },
  {
    code: 'G-A0000165',
    name: '成都佳发安泰教育科技股份有限公司',
    time: '2023-11-08'
  },
  { code: 'G-A0000166', name: '杭州求易科技有限责任公司', time: '2023-11-09' },
  { code: 'G-A0000167', name: '杭州易步数字科技有限公司', time: '2023-11-13' },
  { code: 'G-A0000168', name: '杭州致新软件有限公司', time: '2023-11-20' },
  { code: 'G-A0000169', name: '淄博益企信息技术有限公司', time: '2023-11-21' },
  { code: 'G-A0000170', name: '苏州帝博信息技术有限公司', time: '2023-11-24' },
  { code: 'G-A0000171', name: '陕西宜鼎智能科技有限公司', time: '2023-12-01' },
  { code: 'G-A0000172', name: '广州汇通国信科技有限公司', time: '2023-12-01' },
  {
    code: 'G-A0000173',
    name: '深圳天源迪科信息技术股份有限公司',
    time: '2023-12-14'
  },
  {
    code: 'G-A0000174',
    name: '深圳市赢创万联科技有限公司',
    time: '2023-12-21'
  },
  { code: 'G-A0000175', name: '北京微垣数字科技有限公司', time: '2023-12-26' },
  { code: 'G-A0000176', name: '招商局金融科技有限公司', time: '2023-12-27' },
  { code: 'G-A0000177', name: '宁夏云网智信科技有限公司', time: '2024-01-12' },
  {
    code: 'G-A0000178',
    name: '广东益康生环保服务有限公司',
    time: '2024-01-16'
  },
  { code: 'G-A0000179', name: '浙江鑫图科技有限公司', time: '2024-01-16' },
  { code: 'G-A0000180', name: '深圳赛动智造科技有限公司', time: '2024-01-16' },
  {
    code: 'G-A0000181',
    name: '华院计算技术（上海）股份有限公司',
    time: '2024-01-19'
  },
  {
    code: 'G-A0000182',
    name: '超锐创新（北京）科技有限公司',
    time: '2024-01-24'
  },
  { code: 'G-A0000183', name: '东莞市同橙软件有限公司', time: '2024-01-29' },
  {
    code: 'G-A0000184',
    name: '石家庄融商伟业电子有限公司',
    time: '2024-02-06'
  },
  { code: 'G-A0000185', name: '成都科创空间科技有限公司', time: '2024-02-29' },
  {
    code: 'G-A0000186',
    name: '北京易艾思数字科技有限公司',
    time: '2024-03-07'
  },
  { code: 'G-A0000187', name: '深圳上古软件有限公司', time: '2024-03-08' },
  { code: 'G-A0000188', name: '深圳市巨沃科技有限公司', time: '2024-03-18' },
  {
    code: 'G-A0000189',
    name: '上海极昇数科数据技术有限公司',
    time: '2024-03-25'
  },
  {
    code: 'G-A0000190',
    name: '深圳云图数智信息科技有限公司',
    time: '2024-04-01'
  },
  { code: 'G-A0000191', name: '重庆雪资美科技有限公司', time: '2024-04-01' },
  {
    code: 'G-A0000192',
    name: '软子数字软件（广州）有限公司',
    time: '2024-04-08'
  },
  {
    code: 'G-A0000193',
    name: '上海市建筑科学研究院有限公司',
    time: '2024-04-16'
  },
  { code: 'G-A0000194', name: '上海灵当信息科技有限公司', time: '2024-04-16' },
  { code: 'G-A0000195', name: '中煤航测遥感集团有限公司', time: '2024-04-16' },
  { code: 'G-A0000196', name: '南京光进科技有限公司', time: '2024-04-27' },
  { code: 'G-A0000197', name: '广州聚超软件科技有限公司', time: '2024-05-07' },
  {
    code: 'G-SQ-20240515001',
    name: '武汉趣维云科技有限公司',
    time: '2024-05-15'
  },
  {
    code: 'G-SQ-20240523002',
    name: '北京三友卓越科技有限公司',
    time: '2024-05-23'
  },
  {
    code: 'G-SQ-20240523003',
    name: '金华劲界信息技术有限公司',
    time: '2024-05-23'
  },
  {
    code: 'G-SQ-20240528004',
    name: '昆山市孪数数字科技有限公司',
    time: '2024-05-28'
  },
  {
    code: 'G-SQ-20240529005',
    name: '绵阳探云科技有限公司',
    time: '2024-05-29'
  },
  {
    code: 'G-SQ-20240612001',
    name: '深圳市易联软件科技有限公司',
    time: '2024-06-12'
  },
  {
    code: 'G-SQ-20240612002',
    name: '杭州准到信息科技有限公司',
    time: '2024-06-12'
  },
  {
    code: 'G-SQ-20240702001',
    name: '深圳市浩太科技有限公司',
    time: '2024-07-02'
  },
  {
    code: 'G-SQ-20240704002',
    name: '悦动（深圳）网络传媒有限公司',
    time: '2024-07-04'
  },
  { code: 'G-SQ-20240704003', name: '罗帅', time: '2024-07-04' },
  {
    code: 'G-SQ-20240711004',
    name: '上海数璟信息科技有限公司',
    time: '2024-07-11'
  },
  {
    code: 'G-SQ-20240716005',
    name: '深圳市博达智联科技有限公司',
    time: '2024-07-16'
  },
  {
    code: 'G-SQ-20240718006',
    name: '南京凡创技术服务有限公司',
    time: '2024-07-18'
  },
  {
    code: 'G-SQ-20240904001',
    name: '南京鑫友网络科技有限公司',
    time: '2024-09-04'
  },
  {
    code: 'G-SQ-20240911002',
    name: '慧新全智工业互联科技（青岛）有限公司',
    time: '2024-09-11'
  },
  {
    code: 'G-SQ-20240911003',
    name: '国能日新科技股份有限公司',
    time: '2024-09-11'
  },
  {
    code: 'G-SQ-20240918004',
    name: '晋江市港益纤维制品有限公司',
    time: '2024-09-18'
  },
  { code: 'G-SQ-20240921005', name: '陆敏', time: '2024-09-21' },
  {
    code: 'G-SQ-20240926006',
    name: '年华数据科技有限公司',
    time: '2024-09-26'
  },
  {
    code: 'G-SQ-20240927007',
    name: '成都数自自动化科技有限公司',
    time: '2024-09-27'
  },
  {
    code: 'G-SQ-20240929008',
    name: '北京炎黄盈动科技发展有限责任公司',
    time: '2024-09-29'
  },
  { code: 'G-SQ-20241014001', name: '王子栋', time: '2024-10-01' },
  {
    code: 'G-SQ-20241028002',
    name: '北京三只猫数智科技有限公',
    time: '2024-10-28'
  },
  {
    code: 'G-SQ-20241114001',
    name: '北京中科闻歌科技股份有限公司',
    time: '2024-11-14'
  },
  {
    code: 'G-SQ-20241121002',
    name: '西安衍舆航天科技有限公司',
    time: '2024-11-21'
  },
  {
    code: 'G-SQ-20241122003',
    name: '杭州一多信息技术有限公司',
    time: '2024-11-22'
  },
  {
    code: 'G-SQ-20241126004',
    name: '鲁班（广东）科技有限公司',
    time: '2024-11-26'
  },
  {
    code: 'G-SQ-20241203001',
    name: '红椋（上海）网络科技有限公司',
    time: '2024-12-03'
  },
  {
    code: 'G-SQ-20241205002',
    name: '河南众诚信息科技股份有限公司',
    time: '2024-12-05'
  }
]

export const contentMap = cryptoEncode(JSON.stringify(data))
